[
    {
        "applyEmail": "rajat.srivastava@algofolks.com",
        "company": "Adobe",
        "emailBody": "Dear Smit Shah,\n\nMy name is Gautham Madhu, and I am a Product Manager with 5-10 years of experience, currently at Axis Bank. I'm writing to express my strong interest in the Senior Product Manager for Growth position at Adobe. Having followed Adobe's innovative work, I am particularly drawn to this role's potential to significantly impact user acquisition and engagement.\n\nMy career has been centered around leading product initiatives and driving measurable outcomes. As a Product Manager at Axis Bank, I've honed my skills in strategic planning, market analysis, and product lifecycle management. Prior to this, my experience as a Team Lead at J. Edgerton Consulting (04/2015 - 04/2022) and Resolutions Team Lead at Mount Rose Technologies (10/2010 - 03/2015) further developed my leadership and team management capabilities, both critical for a growth-focused role.\n\nI possess a robust skill set that aligns well with the requirements for a Senior Product Manager for Growth, including strong leadership and teamwork, effective time management, customer service, and communication skills. My knowledge of digital performance metrics and risk management has consistently enabled me to make data-driven decisions that propel product success. I am also proficient in multiple languages (English, Spanish, Polish, French), which could be a valuable asset in a global organization like Adobe.\n\nI am confident that my experience and passion for driving product growth would allow me to make significant contributions to Adobe. I have attached my resume for your review and would be grateful for the opportunity to discuss how my skills and experience can benefit your team. Please let me know if a brief call would be possible at your convenience.\n\nThank you for your time and consideration.\n\nSincerely,\nGautham Madhu\ngauthammadhu27@gmail.com",
        "emailSent": false,
        "emailSubject": "Experienced Product Manager | Driving Growth at Adobe | Gautham Madhu",
        "experience": "",
        "fullDescription": "We're hiring a Senior PM for Growth at Adobe.\n\nIf you've ever wanted to work on tools that millions of creators use every day, here's your chance- We are looking for a Senior Product Manager to join our team building Premiere Pro and next-gen video tools.\n\nWhy this team?\nWe're reimagining how creators work with video, from AI-powered features like Object Masking and Generative Extend to completely new workflows that didn't exist a year ago.\nThe problems are hard. The impact is real. And genuinely one of the best team I've worked with. You'll collaborate with world-class researchers, designers, and engineers who care deeply about craft. You'll ship features that professional editors, filmmakers, and content creators rely on and help shape the future of video creation.\n\nWhat we're looking for-\nSomeone who understands growth, loves working cross-functionally, and gets excited about turning powerful tech to products people actually want to use.\nIf that sounds like you, let's talk. DM me\n\nhttps://lnkd.in/gfh58DUX",
        "hiringManager": "Overview\nOutreach\nEmail",
        "jdResumeBuilt": true,
        "jdResumeBuiltAt": "2026-02-23T13:39:40.902Z",
        "jobId": "job_483800157",
        "location": "",
        "processedAt": "2026-02-23T12:59:01.270Z",
        "shortDescription": "Senior Product Manager for Growth\n\nAdobe\n\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\nWe're hiring a Senior PM for Growth at Adobe.If you've ever wanted to work on tools that millions of creators use every day, here's your chance- We are looking for a Senior Product Manager to join our team building Premiere Pro and next-gen video tools.Why this team?We're reimagining how creators wo...\n\nView Full Post\nHiring Manager\nSS\nSmit Shah’s\n\nPrincipal Product Manager- GenAI @ Adobe | Driving Product Lifec",
        "source": "linkedin",
        "title": "Senior Product Manager for Growth",
        "updatedAt": "2026-02-23T13:39:40.917813",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7431195300490457088"
    },
    {
        "applyEmail": "not-provided",
        "company": "LinkedIn",
        "emailBody": "Dear [Hiring Manager Name],\n\nMy name is Gautham Madhu, and I am writing to express my strong interest in the Product Manager position at LinkedIn. With 5-10 years of experience in product management, most recently at Axis Bank, I have developed a robust skill set in areas such as risk management, digital performance metrics, and staff management that I believe would be a significant asset to your team.\n\nMy career has provided me with practical experience in leading product initiatives and managing complex projects. As a Team Lead at J. Edgerton Consulting from 2015-2022 and previously at Mount Rose Technologies, I consistently demonstrated leadership, effective time management, and strong communication skills – all of which are vital for a successful Product Manager at an innovative company like LinkedIn.\n\nI am particularly drawn to LinkedIn's mission and its continuous evolution of user-focused products. My background in understanding customer service needs and my ability to analyze digital performance metrics align perfectly with the demands of this role. I am adept at translating user insights into actionable product strategies, ensuring both user satisfaction and business growth.\n\nI am confident that my blend of strategic thinking, hands-on leadership, and international communication skills (English, Spanish, Polish, French) would enable me to contribute meaningfully to your team from day one. I am eager to learn more about this opportunity and discuss how my experience and passion for product development can benefit LinkedIn.\n\nThank you for your time and consideration. I have attached my resume for your review and look forward to the possibility of connecting.\n\nSincerely,\nGautham Madhu\ngauthammadhu27@gmail.com",
        "emailSent": false,
        "emailSubject": "Product Manager Application - Gautham Madhu (5-10 Yrs Experience, Risk Mgmt)",
        "experience": "",
        "fullDescription": "🚀 𝐒𝐭𝐚𝐫𝐭𝐢𝐧𝐠 𝐲𝐨𝐮𝐫 𝐣𝐨𝐮𝐫𝐧𝐞𝐲 𝐢𝐧 𝐏𝐫𝐨𝐝𝐮𝐜𝐭 𝐌𝐚𝐧𝐚𝐠𝐞𝐦𝐞𝐧𝐭?\n\nOne of the biggest questions beginners face is:\nWhat should I focus on learning first? 🤔\n\nProduct Management is a mix of strategy, data, empathy, and communication — but mastering everything at once can feel overwhelming.\n\nSo here’s a quick poll for aspiring PMs 👇\n\nCast your vote and share your reasoning in the comments — I’d love to hear different perspectives! 💬\n\n\nhashtag\n#ProductManagement \nhashtag\n#PMBeginner \nhashtag\n#CareerGrowth \nhashtag\n#ProductThinking \nhashtag\n#Upskill \nhashtag\n#LinkedInPoll \nhashtag\n#PMReadyJobs \nhashtag\n#PMJaobs \nhashtag\n#PMPoll \nhashtag\n#PMCareer \nhashtag\n#PMHustle \nhashtag\n#PMReadyGrowth \nhashtag\n#PMReadyJourney \nhashtag\n#PMReadySupport \nhashtag\n#PMReadyPreparation \nhashtag\n#PMReadyPoll",
        "hiringManager": "N/A",
        "jdResumeBuilt": true,
        "jobId": "job_400502617",
        "location": "",
        "processedAt": "2026-02-23T13:38:43.192Z",
        "shortDescription": "Product Manager\n\nLinkedIn\n\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\n🚀 𝐒𝐭𝐚𝐫𝐭𝐢𝐧𝐠 𝐲𝐨𝐮𝐫 𝐣𝐨𝐮𝐫𝐧𝐞𝐲 𝐢𝐧 𝐏𝐫𝐨𝐝𝐮𝐜𝐭 𝐌𝐚𝐧𝐚𝐠𝐞𝐦𝐞𝐧𝐭?One of the biggest questions beginners face is:What should I focus on learning first? 🤔Product Management is a mix of strategy, data, empathy, and communication — but mastering everything at once can feel overwhelm...\n\nView Full Post\nAI Analysis\nAnalyzing job post...\nClose",
        "source": "linkedin",
        "title": "Product Manager",
        "updatedAt": "2026-02-23T13:40:33.393597",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7430854047286407168",
        "jdResumeBuiltAt": "2026-02-23T13:40:33.388Z"
    },
    {
        "applyEmail": "not-provided",
        "company": "Confidential",
        "emailBody": "Dear Pavan Kumar S’,\n\nMy name is Gautham Madhu, and I am a Product Manager at Axis Bank with over 5 years of experience in product development and leadership. I am writing to express my strong interest in Product Manager roles, such as Junior Product Manager, Associate Product Manager, Technical Product Manager, or AI Product Manager, within your organization.\n\nThroughout my career, I've developed a robust skill set encompassing Leadership and Teamwork, Effective Time Management, Customer Service, and Communication Skills. As a Team Lead at J. Edgerton Consulting from 2015 to 2022, and prior to that, as a Resolutions Team Lead at Mount Rose Technologies from 2010 to 2015, I gained invaluable experience in managing teams, driving resolutions, and ensuring customer satisfaction – all critical components of successful product management.\n\nMy expertise extends to Risk Management and a keen Knowledge of Digital Performance Metrics, which I believe are essential for navigating the complexities of modern product landscapes, especially in emerging fields like AI Product Management. My ability to communicate effectively in multiple languages (English, Spanish, Polish, French) also provides a unique advantage in diverse and global product environments.\n\nI am confident that my blend of strategic thinking, hands-on leadership, and dedication to user-centric solutions would make me a valuable asset to your team. I am eager to contribute to a company that values innovation and growth.\n\nWould you be open to a brief conversation about how my experience aligns with your team's needs? I have attached my resume for your review and look forward to hearing from you.\n\nThank you for your time and consideration.\n\nSincerely,\n\nGautham Madhu\ngauthammadhu27@gmail.com",
        "emailSent": false,
        "emailSubject": "Product Manager with 5+ Years Experience | Gautham Madhu | Interested in AI Product Management",
        "experience": "",
        "fullDescription": "Happy Monday, ...everyone!.I’m actively looking for opportunities in the Product space — roles like Junior Product Manager, Associate Product Manager, Product Analyst, Business Analyst, Technical Product Manager, or AI Product Manager.\n\nWith a strong mix of analytical thinking, user empathy, and collaboration skills, I enjoy turning insights into meaningful product decisions that improve user experience and drive growth.\n\nI’m eager to contribute to a product-driven organization where I can learn, create impact, and grow with the team.\n\nIf you’re an HR professional, Hiring Manager, Product Leader, or part of a product-based company looking for passionate talent — I’d love to connect and explore how I can add value.\n\n📞 Open to discussions, interviews, and referrals — please feel free to DM me or tag someone who’s hiring!\n\nLet’s make this week productive and full of new beginnings.\n\n\nhashtag\n#OpenToWork \nhashtag\n#ProductManagement \nhashtag\n#ProductCareer \nhashtag\n#BusinessAnalyst \nhashtag\n#Hiring \nhashtag\n#AssociateProductManager \nhashtag\n#TechJobs \nhashtag\n#AIProductManager \nhashtag\n#CareerGrowth",
        "hiringManager": "Overview\nOutreach\nEmail",
        "jdResumeBuilt": true,
        "jobId": "job_943211553",
        "location": "",
        "processedAt": "2026-02-23T13:39:03.344Z",
        "shortDescription": "Junior Product Manager, Associate Product Manager, Product Analyst, Business Analyst, Technical Product Manager, or AI Product Manager\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\nHappy Monday, ...everyone!.I’m actively looking for opportunities in the Product space — roles like Junior Product Manager, Associate Product Manager, Product Analyst, Business Analyst, Technical Product Manager, or AI Product Manager.With a strong mix of analytical thinking, user empathy, and colla...\n\nView Full Post\nHi",
        "source": "linkedin",
        "title": "Junior Product Manager, Associate Product Manager, Product Analyst, Business Analyst, Technical Product Manager, or AI Product Manager",
        "updatedAt": "2026-02-23T13:41:14.746706",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7431608794146832385",
        "jdResumeBuiltAt": "2026-02-23T13:41:14.741Z"
    }
]