[
    {
        "applyEmail": "rajat.srivastava@algofolks.com",
        "company": "Adobe",
        "emailBody": "Dear Smit Shah,\n\nMy name is Gautham Madhu, and I am a Product Manager with 5-10 years of experience, currently at Axis Bank. I'm writing to express my strong interest in the Senior Product Manager for Growth position at Adobe. Having followed Adobe's innovative work, I am particularly drawn to this role's potential to significantly impact user acquisition and engagement.\n\nMy career has been centered around leading product initiatives and driving measurable outcomes. As a Product Manager at Axis Bank, I've honed my skills in strategic planning, market analysis, and product lifecycle management. Prior to this, my experience as a Team Lead at J. Edgerton Consulting (04/2015 - 04/2022) and Resolutions Team Lead at Mount Rose Technologies (10/2010 - 03/2015) further developed my leadership and team management capabilities, both critical for a growth-focused role.\n\nI possess a robust skill set that aligns well with the requirements for a Senior Product Manager for Growth, including strong leadership and teamwork, effective time management, customer service, and communication skills. My knowledge of digital performance metrics and risk management has consistently enabled me to make data-driven decisions that propel product success. I am also proficient in multiple languages (English, Spanish, Polish, French), which could be a valuable asset in a global organization like Adobe.\n\nI am confident that my experience and passion for driving product growth would allow me to make significant contributions to Adobe. I have attached my resume for your review and would be grateful for the opportunity to discuss how my skills and experience can benefit your team. Please let me know if a brief call would be possible at your convenience.\n\nThank you for your time and consideration.\n\nSincerely,\nGautham Madhu\ngauthammadhu27@gmail.com",
        "emailSent": true,
        "emailSubject": "Experienced Product Manager | Driving Growth at Adobe | Gautham Madhu",
        "experience": "",
        "fullDescription": "We're hiring a Senior PM for Growth at Adobe.\n\nIf you've ever wanted to work on tools that millions of creators use every day, here's your chance- We are looking for a Senior Product Manager to join our team building Premiere Pro and next-gen video tools.\n\nWhy this team?\nWe're reimagining how creators work with video, from AI-powered features like Object Masking and Generative Extend to completely new workflows that didn't exist a year ago.\nThe problems are hard. The impact is real. And genuinely one of the best team I've worked with. You'll collaborate with world-class researchers, designers, and engineers who care deeply about craft. You'll ship features that professional editors, filmmakers, and content creators rely on and help shape the future of video creation.\n\nWhat we're looking for-\nSomeone who understands growth, loves working cross-functionally, and gets excited about turning powerful tech to products people actually want to use.\nIf that sounds like you, let's talk. DM me\n\nhttps://lnkd.in/gfh58DUX",
        "hiringManager": "Overview\nOutreach\nEmail",
        "jdResumeBuilt": true,
        "jdResumeBuiltAt": "2026-02-24T06:31:53.609Z",
        "jobId": "job_483800157",
        "location": "",
        "processedAt": "2026-02-23T12:59:01.270Z",
        "shortDescription": "Senior Product Manager for Growth\n\nAdobe\n\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\nWe're hiring a Senior PM for Growth at Adobe.If you've ever wanted to work on tools that millions of creators use every day, here's your chance- We are looking for a Senior Product Manager to join our team building Premiere Pro and next-gen video tools.Why this team?We're reimagining how creators wo...\n\nView Full Post\nHiring Manager\nSS\nSmit Shah’s\n\nPrincipal Product Manager- GenAI @ Adobe | Driving Product Lifec",
        "source": "linkedin",
        "title": "Senior Product Manager for Growth",
        "updatedAt": "2026-02-24T06:31:53.616565",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7431195300490457088",
        "emailSentAt": "2026-02-24T06:31:52.726120"
    },
    {
        "applyEmail": "kisah.hrms@kisah.in",
        "company": "Kisah APPARELS PVT LTD",
        "emailBody": "Dear SANTANU MONDAL,\n\nMy name is Gautham Madhu, and I am writing to express my strong interest in the Product Manager – D2C Fashion (Web, App & Omnichannel) position at Kisah APPARELS. As a Product Manager with 5-10 years of experience, most recently at Axis Bank, I have developed a robust skill set in digital strategy, team leadership, and customer-centric product development that I believe would be a significant asset to your team.\n\nWhile my recent experience is in banking, my core competencies are highly transferable to the dynamic D2C fashion space. At Axis Bank, I was responsible for [mention a relevant project/achievement here if you had provided it, e.g., 'driving the development of new digital banking features, focusing on user experience and conversion optimization']. This experience has honed my understanding of digital performance metrics and the importance of user journeys across multiple platforms – directly applicable to managing web, app, and omnichannel experiences for Kisah.\n\nFurthermore, my previous roles as Team Lead at J. Edgerton Consulting (7 years) and Resolutions Team Lead at Mount Rose Technologies (4.5 years) have equipped me with extensive leadership and teamwork skills, effective time management, and a deep appreciation for customer service. I am adept at staff management and fostering collaborative environments, which are crucial for guiding product development from conception to launch.\n\nI am particularly excited by the prospect of working in the D2C fashion industry and leveraging my communication skills and knowledge of digital performance metrics to contribute to Kisah APPARELS' growth. My ability to speak multiple languages, including French and Spanish, also offers a unique perspective on diverse customer needs.\n\nI am confident that my blend of product management expertise, leadership background, and passion for digital-first strategies makes me an ideal candidate for this role. I have attached my resume for your review and would be grateful for the opportunity to discuss how my qualifications align with Kisah's vision. Please feel free to reach out to me at gauthammadhu27@gmail.com.\n\nThank you for your time and consideration.\n\nSincerely,\nGautham Madhu",
        "emailSent": true,
        "emailSubject": "Product Manager – D2C Fashion Application: Gautham Madhu (Ex-Axis Bank PM)",
        "experience": "",
        "fullDescription": "🚀 We’re Hiring | Product Manager – D2C Fashion (Web, App & Omnichannel)\n\nAt Kisah APPARELS PVT LTD, we’re building the next-gen men’s occasion-wear brand for Gen Z & modern India bold, digital-first, and omnichannel.\n\nWe’re looking for a Product Manager who can own the end-to-end customer journey across our D2C website, app, and retail touchpoints.\n\n📍 Location: Kolkata, Onsite.\nApply Mail at:- kisah.hrms@kisah.in \n\n🔎 What you’ll drive:\n • Customer experience & repeat growth\n • Site merchandising & product discovery (PLP, PDP, Search)\n • CRO & A/B experimentation\n • Omnichannel product roadmap\n • Tech & sprint ownership\n\n📊 Strong preference for candidates with:\n ✔ D2C / E-commerce experience\n ✔ Fashion or variant-heavy catalog exposure\n ✔ Hands-on analytics & experimentation mindset\n ✔ Business-first product thinking\nIf you’re excited about building a fashion-first, digital-first brand at scale we’d love to connect.",
        "hiringManager": "Overview\nOutreach\nEmail",
        "jdResumeBuilt": true,
        "jobId": "job_1160899571",
        "location": "",
        "processedAt": "2026-02-24T06:31:17.767Z",
        "shortDescription": "Product Manager – D2C Fashion (Web, App & Omnichannel)\n\nKisah APPARELS PVT LTD\n\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\n🚀 We’re Hiring | Product Manager – D2C Fashion (Web, App & Omnichannel)At Kisah APPARELS PVT LTD, we’re building the next-gen men’s occasion-wear brand for Gen Z & modern India bold, digital-first, and omnichannel.We’re looking for a Product Manager who can own the end-to-end customer journey acros...\n\nView Full Post\nHiring Manager\nSMh\nSANTANU MONDAL’s hiring\n\nManager-Talen",
        "source": "linkedin",
        "title": "Product Manager – D2C Fashion (Web, App & Omnichannel)",
        "updatedAt": "2026-02-24T06:32:44.857807",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7431597952965496832",
        "jdResumeBuiltAt": "2026-02-24T06:32:44.851Z",
        "emailSentAt": "2026-02-24T06:32:43.964028"
    }
]