[
    {
        "applyEmail": "vishal.gupta@algofolks.com",
        "company": "Adobe",
        "emailBody": "Dear Smit Shah,\n\nMy name is Gautham Madhu, and I am a Product Manager with 5-10 years of experience, currently at Axis Bank. I'm writing to express my strong interest in the Senior Product Manager for Growth position at Adobe. Having followed Adobe's innovative work, I am particularly drawn to this role's potential to significantly impact user acquisition and engagement.\n\nMy career has been centered around leading product initiatives and driving measurable outcomes. As a Product Manager at Axis Bank, I've honed my skills in strategic planning, market analysis, and product lifecycle management. Prior to this, my experience as a Team Lead at J. Edgerton Consulting (04/2015 - 04/2022) and Resolutions Team Lead at Mount Rose Technologies (10/2010 - 03/2015) further developed my leadership and team management capabilities, both critical for a growth-focused role.\n\nI possess a robust skill set that aligns well with the requirements for a Senior Product Manager for Growth, including strong leadership and teamwork, effective time management, customer service, and communication skills. My knowledge of digital performance metrics and risk management has consistently enabled me to make data-driven decisions that propel product success. I am also proficient in multiple languages (English, Spanish, Polish, French), which could be a valuable asset in a global organization like Adobe.\n\nI am confident that my experience and passion for driving product growth would allow me to make significant contributions to Adobe. I have attached my resume for your review and would be grateful for the opportunity to discuss how my skills and experience can benefit your team. Please let me know if a brief call would be possible at your convenience.\n\nThank you for your time and consideration.\n\nSincerely,\nGautham Madhu\ngauthammadhu27@gmail.com",
        "emailSent": true,
        "emailSentAt": "2026-02-24T06:31:52.726120",
        "emailSubject": "Experienced Product Manager | Driving Growth at Adobe | Gautham Madhu",
        "experience": "",
        "fullDescription": "We're hiring a Senior PM for Growth at Adobe.\n\nIf you've ever wanted to work on tools that millions of creators use every day, here's your chance- We are looking for a Senior Product Manager to join our team building Premiere Pro and next-gen video tools.\n\nWhy this team?\nWe're reimagining how creators work with video, from AI-powered features like Object Masking and Generative Extend to completely new workflows that didn't exist a year ago.\nThe problems are hard. The impact is real. And genuinely one of the best team I've worked with. You'll collaborate with world-class researchers, designers, and engineers who care deeply about craft. You'll ship features that professional editors, filmmakers, and content creators rely on and help shape the future of video creation.\n\nWhat we're looking for-\nSomeone who understands growth, loves working cross-functionally, and gets excited about turning powerful tech to products people actually want to use.\nIf that sounds like you, let's talk. DM me\n\nhttps://lnkd.in/gfh58DUX",
        "hiringManager": "Overview\nOutreach\nEmail",
        "jdResumeBuilt": true,
        "jdResumeBuiltAt": "2026-02-25T06:03:06.604Z",
        "jobId": "job_483800157",
        "location": "",
        "processedAt": "2026-02-23T12:59:01.270Z",
        "shortDescription": "Senior Product Manager for Growth\n\nAdobe\n\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\nWe're hiring a Senior PM for Growth at Adobe.If you've ever wanted to work on tools that millions of creators use every day, here's your chance- We are looking for a Senior Product Manager to join our team building Premiere Pro and next-gen video tools.Why this team?We're reimagining how creators wo...\n\nView Full Post\nHiring Manager\nSS\nSmit Shah’s\n\nPrincipal Product Manager- GenAI @ Adobe | Driving Product Lifec",
        "source": "linkedin",
        "title": "Senior Product Manager for Growth",
        "updatedAt": "2026-02-25T06:03:06.616240",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7431195300490457088"
    },
    {
        "applyEmail": "anju.tiwari@merilife.com",
        "company": "Merilife",
        "emailBody": "Dear Anju Tiwari,\n\nMy name is Gautham Madhu, and I am writing to express my strong interest in the Product Manager – Peripheral Intervention Portfolio role at Merilife, which I believe aligns perfectly with my skills and experience. With 5-10 years as a Product Manager, including my recent tenure at Axis Bank, I possess a robust understanding of product lifecycle management, strategic planning, and market analysis.\n\nMy background includes significant experience in leading teams, as demonstrated by my roles as Team Lead at J. Edgerton Consulting and Resolutions Team Lead at Mount Rose Technologies. These positions honed my leadership and teamwork capabilities, as well as my effective time management skills – all crucial for managing a complex portfolio like Peripheral Intervention.\n\nI am particularly adept at risk management and have a strong grasp of digital performance metrics, which I understand are vital for success in today's product landscape. My communication skills, fluent in English, Spanish, Polish, and French, would be an asset in collaborating with diverse stakeholders and expanding market reach for Merilife's innovative products.\n\nMerilife's commitment to advancing healthcare through pioneering solutions deeply resonates with my professional aspirations. I am confident that my blend of strategic thinking, hands-on product management experience, and a keen eye for customer service would allow me to make immediate and significant contributions to your Peripheral Intervention Portfolio.\n\nI have attached my resume for your review and would be grateful for the opportunity to discuss how my qualifications and enthusiasm can benefit Merilife. Would you be available for a brief call next week?\n\nThank you for your time and consideration.\n\nSincerely,\nGautham Madhu\ngauthammadhu27@gmail.com",
        "emailSent": false,
        "emailSubject": "Experienced Product Manager (Axis Bank) for Merilife's Peripheral Intervention Portfolio - Gautham Madhu",
        "experience": "",
        "fullDescription": "Anju Tiwari\n3d\n\n🚀We’re hiring a Product Manager – Peripheral Intervention Portfolio for an international role based in India to lead strategy, support product launches, and drive growth of innovative vascular solutions.\nIf you have MedTech/healthcare marketing experience and enjoy cross-functional collaboration, let’s connect!\n\n#Hiring #ProductManagement #MedTech #HealthcareCareers\n\nInterested candidates please share DM or share your CV on anju.tiwari@merilife.com\n\nBalan MuthuAnita NagarRachna SaxenaBhavika Ranpara JanjarkiyaKomal PatilNeha BajpaiReepa Sarda\n\nProduct Manager\nMeril, Mumbai, Maharashtra, India\n72\n11",
        "hiringManager": "Overview\nOutreach\nEmail",
        "jdResumeBuilt": true,
        "jobId": "job_993125625",
        "location": "",
        "processedAt": "2026-02-25T10:01:52.043Z",
        "shortDescription": "Product Manager – Peripheral Intervention Portfolio\n\nMerilife\n\nReviewed\nOverview\nOutreach\nEmail\nJob Post\n\n🚀We’re hiring a Product Manager – Peripheral Intervention Portfolio for an international role based in India to lead strategy, support product launches, and drive growth of innovative vascular solutions.If you have MedTech/healthcare marketing experience and enjoy cross-functional collaboration, le...\n\nView Full Post\nHiring Manager\nAT\nAnju Tiwari’s\n\nManager- Human ResourcesManager- Human Re",
        "source": "linkedin",
        "title": "Product Manager – Peripheral Intervention Portfolio",
        "updatedAt": "2026-02-25T10:02:35.160427",
        "viewFullPostUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7430952817952989184",
        "jdResumeBuiltAt": "2026-02-25T10:02:35.139Z"
    }
]